In [1]:
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load in 

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

# Input data files are available in the "../input/" directory.
# For example, running this (by clicking run or pressing Shift+Enter) will list the files in the input directory

import os
print(os.listdir("../input"))

# Any results you write to the current directory are saved as output.

['train.csv']

In [2]:
titanic_data=pd.read_csv("../input/train.csv")

titanic_data.head(10)

   PassengerId  Survived  Pclass    ...        Fare Cabin  Embarked
0            1         0       3    ...      7.2500   NaN         S
1            2         1       1    ...     71.2833   C85         C
2            3         1       3    ...      7.9250   NaN         S
3            4         1       1    ...     53.1000  C123         S
4            5         0       3    ...      8.0500   NaN         S
5            6         0       3    ...      8.4583   NaN         Q
6            7         0       1    ...     51.8625   E46         S
7            8         0       3    ...     21.0750   NaN         S
8            9         1       3    ...     11.1333   NaN         S
9           10         1       2    ...     30.0708   NaN         C

[10 rows x 12 columns]

In [3]:
titanic_data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [4]:
titanic_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
# removing null values of age and embarked

titanic_data['Embarked']=titanic_data['Embarked'].replace(np.nan,'S')
median=titanic_data['Age'].median()
median
titanic_data['Age']=titanic_data['Age'].replace(np.nan,median)

In [6]:
titanic_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [7]:
# dealing with categorial values -----converting into numerical values by using labelencoder
from sklearn import preprocessing
le_sex=preprocessing.LabelEncoder()
le_sex.fit(titanic_data.Sex.unique())
titanic_data.Sex=le_sex.transform(titanic_data.Sex)

from sklearn import preprocessing
le_Embarked=preprocessing.LabelEncoder()
le_Embarked.fit(titanic_data.Embarked.unique())
titanic_data.Embarked=le_Embarked.transform(titanic_data.Embarked)

from sklearn import preprocessing
le_Pclass=preprocessing.LabelEncoder()
le_Pclass.fit(titanic_data.Pclass.unique())
titanic_data.Pclass=le_Pclass.transform(titanic_data.Pclass)

In [8]:
titanic_data.head()

   PassengerId  Survived  Pclass    ...        Fare  Cabin  Embarked
0            1         0       2    ...      7.2500    NaN         2
1            2         1       0    ...     71.2833    C85         0
2            3         1       2    ...      7.9250    NaN         2
3            4         1       0    ...     53.1000   C123         2
4            5         0       2    ...      8.0500    NaN         2

[5 rows x 12 columns]

In [9]:
#dropping ["PassengerId","Name","Survived","Ticket","Cabin"] columns as they dont effect surviving people

X=titanic_data.drop(["PassengerId","Name","Survived","Ticket","Cabin"],axis=1)
X.isnull().sum()
X.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0       2    1  22.0      1      0   7.2500         2
1       0    0  38.0      1      0  71.2833         0
2       2    0  26.0      0      0   7.9250         2
3       0    0  35.0      1      0  53.1000         2
4       2    1  35.0      0      0   8.0500         2

In [10]:
Y=titanic_data.iloc[:,1]

Y.isnull().sum()
Y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [11]:
from sklearn.model_selection import train_test_split
X_train, X_test, Y_train, Y_test= train_test_split(X,Y,test_size=0.2,random_state=20)

from sklearn.linear_model import LogisticRegression

logmodel=LogisticRegression()

logmodel.fit(X_train, Y_train)

predictions=logmodel.predict(X_test)

/opt/conda/lib/python3.6/site-packages/sklearn/linear_model/logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

In [12]:


from sklearn.metrics import classification_report

classification_report(Y_test, predictions)

'              precision    recall  f1-score   support\n\n           0       0.84      0.91      0.88       112\n           1       0.83      0.72      0.77        67\n\n    accuracy                           0.84       179\n   macro avg       0.84      0.81      0.82       179\nweighted avg       0.84      0.84      0.84       179\n'

In [13]:
from sklearn.metrics import confusion_matrix

confusion_matrix(Y_test,predictions)

array([[102,  10],
       [ 19,  48]])

In [14]:
from sklearn.metrics import accuracy_score

accuracy_score(Y_test,predictions)

0.8379888268156425